{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "-": 5,
      "0": 6,
      "1": 7,
      "2": 8,
      "3": 9,
      "4": 10,
      "5": 11,
      "6": 12,
      "7": 13,
      "8": 14,
      "9": 15,
      ":": 16,
      "A": 17,
      "S": 18,
      "a": 19,
      "b": 20,
      "c": 21,
      "d": 22,
      "e": 23,
      "f": 24,
      "i": 25,
      "k": 26,
      "l": 27,
      "m": 28,
      "n": 29,
      "o": 30,
      "p": 31,
      "r": 32,
      "s": 33,
      "t": 34,
      "u": 35,
      "w": 36,
      "y": 37,
      "20": 38,
      "00": 39,
      "202": 40,
      "11": 41,
      "aa": 42,
      "73": 43,
      "2024": 44,
      "41": 45,
      "lo": 46,
      "d0": 47,
      "fd": 48,
      "7d": 49,
      "ce": 50,
      "d4": 51,
      "68": 52,
      "14": 53,
      "22": 54,
      "15": 55,
      "05": 56,
      "2023": 57,
      "28": 58,
      "26": 59,
      "12": 60,
      "43": 61,
      "51": 62,
      "49": 63,
      "04": 64,
      "01": 65,
      "03": 66,
      "02": 67,
      "clo": 68,
      "se": 69,
      "close": 70,
      "17d": 71,
      "2aa": 72,
      "4e": 73,
      "6fd": 74,
      "773": 75,
      "815": 76,
      "917d": 77,
      "a815": 78,
      "aab": 79,
      "2843": 80,
      "51aab": 81,
      "2aaa815": 82,
      "4ed0": 83,
      "6fdd": 84,
      "7732843": 85,
      "2aaa815f": 86,
      "773284351aab": 87,
      "1e": 88,
      "6c": 89,
      "75": 90,
      "88": 91,
      "b1e": 92,
      "b88": 93,
      "d9": 94,
      "fb1e": 95,
      "116c": 96,
      "73116c": 97,
      "fd73116c": 98,
      "d4fd73116c": 99,
      "68fb1e": 100,
      "2675": 101,
      "49ce": 102,
      "b889": 103,
      "d4fd73116cd0": 104,
      "68fb1ed9": 105,
      "1a": 106,
      "2ce": 107,
      "4a": 108,
      "5a": 109,
      "66": 110,
      "92ce": 111,
      "ae": 112,
      "ar": 113,
      "b11": 114,
      "c8": 115,
      "e7d": 116,
      "f73": 117,
      "f1a": 118,
      "f66": 119,
      "41d4": 120,
      "5ab11": 121,
      "92ce5ab11": 122,
      "aec8": 123,
      "arm": 124,
      "e7db": 125,
      "f7392ce5ab11": 126,
      "f1a4a": 127,
      "f66f1a4a": 128,
      "1c": 129,
      "505": 130,
      "7a": 131,
      "8b": 132,
      "900": 133,
      "968": 134,
      "ba": 135,
      "bd": 136,
      "ca": 137,
      "ck": 138,
      "cbd": 139,
      "d14": 140,
      "20d14": 141,
      "41ca": 142,
      "lock": 143,
      "1c22": 144,
      "5057a": 145,
      "8bba": 146,
      "900cbd": 147,
      "96820d14": 148,
      "5057a3": 149,
      "900cbd5057a3": 150,
      "en": 151,
      "op": 152,
      "open": 153,
      "ay": 154,
      "nlock": 155,
      "unlock": 156,
      "06": 157,
      "10": 158,
      "16": 159,
      "08": 160,
      "18": 161,
      "07": 162,
      "13": 163,
      "17": 164,
      "19": 165,
      "09": 166,
      "21": 167,
      "23": 168,
      "di": 169,
      "sarm": 170,
      "disarm": 171,
      "St": 172,
      "armSt": 173,
      "armStay": 174,
      "Aw": 175,
      "armAw": 176,
      "armAway": 177,
      "24": 178,
      "30": 179,
      "27": 180,
      "29": 181,
      "25": 182,
      "31": 183,
      "38": 184,
      "56": 185,
      "32": 186,
      "40": 187,
      "46": 188,
      "48": 189,
      "50": 190,
      "36": 191,
      "42": 192,
      "44": 193,
      "52": 194,
      "34": 195,
      "58": 196,
      "54": 197,
      "33": 198,
      "59": 199,
      "35": 200,
      "53": 201,
      "45": 202,
      "57": 203,
      "37": 204,
      "55": 205,
      "47": 206,
      "39": 207
    },
    "merges": [
      "2 0",
      "0 0",
      "20 2",
      "1 1",
      "a a",
      "7 3",
      "202 4",
      "4 1",
      "l o",
      "d 0",
      "f d",
      "7 d",
      "c e",
      "d 4",
      "6 8",
      "1 4",
      "2 2",
      "1 5",
      "0 5",
      "202 3",
      "2 8",
      "2 6",
      "1 2",
      "4 3",
      "5 1",
      "4 9",
      "0 4",
      "0 1",
      "0 3",
      "0 2",
      "c lo",
      "s e",
      "clo se",
      "1 7d",
      "2 aa",
      "4 e",
      "6 fd",
      "7 73",
      "8 15",
      "9 17d",
      "a 815",
      "aa b",
      "28 43",
      "51 aab",
      "2aa a815",
      "4e d0",
      "6fd d",
      "773 2843",
      "2aaa815 f",
      "7732843 51aab",
      "1 e",
      "6 c",
      "7 5",
      "8 8",
      "b 1e",
      "b 88",
      "d 9",
      "f b1e",
      "11 6c",
      "73 116c",
      "fd 73116c",
      "d4 fd73116c",
      "68 fb1e",
      "26 75",
      "49 ce",
      "b88 9",
      "d4fd73116c d0",
      "68fb1e d9",
      "1 a",
      "2 ce",
      "4 a",
      "5 a",
      "6 6",
      "9 2ce",
      "a e",
      "a r",
      "b 11",
      "c 8",
      "e 7d",
      "f 73",
      "f 1a",
      "f 66",
      "41 d4",
      "5a b11",
      "92ce 5ab11",
      "ae c8",
      "ar m",
      "e7d b",
      "f73 92ce5ab11",
      "f1a 4a",
      "f66 f1a4a",
      "1 c",
      "5 05",
      "7 a",
      "8 b",
      "9 00",
      "9 68",
      "b a",
      "b d",
      "c a",
      "c k",
      "c bd",
      "d 14",
      "20 d14",
      "41 ca",
      "lo ck",
      "1c 22",
      "505 7a",
      "8b ba",
      "900 cbd",
      "968 20d14",
      "5057a 3",
      "900cbd 5057a3",
      "e n",
      "o p",
      "op en",
      "a y",
      "n lock",
      "u nlock",
      "0 6",
      "1 0",
      "1 6",
      "0 8",
      "1 8",
      "0 7",
      "1 3",
      "1 7",
      "1 9",
      "0 9",
      "2 1",
      "2 3",
      "d i",
      "s arm",
      "di sarm",
      "S t",
      "arm St",
      "armSt ay",
      "A w",
      "arm Aw",
      "armAw ay",
      "2 4",
      "3 0",
      "2 7",
      "2 9",
      "2 5",
      "3 1",
      "3 8",
      "5 6",
      "3 2",
      "4 0",
      "4 6",
      "4 8",
      "5 0",
      "3 6",
      "4 2",
      "4 4",
      "5 2",
      "3 4",
      "5 8",
      "5 4",
      "3 3",
      "5 9",
      "3 5",
      "5 3",
      "4 5",
      "5 7",
      "3 7",
      "5 5",
      "4 7",
      "3 9"
    ]
  }
}